![BTS](img/Logo-BTS.jpg)

# Session 2: Cleaning, filtering, joining and grouping

### Juan Luis Cano Rodr√≠guez <juan.cano@bts.tech> - Data Science Foundations (2018-10-03)

Open this notebook in Google Colaboratory: [![Open in Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/Juanlu001/bts-mbds-data-science-foundations/blob/master/sessions/02-Cleaning-Filtering-Joining-Grouping.ipynb)

## Exercise 1: Loading tricky datasets

1. Load https://github.com/Juanlu001/bts-mbds-data-science-foundations/raw/master/sessions/data/model.txt in pandas using proper parameters in `read_csv`
2. Load https://github.com/Juanlu001/bts-mbds-data-science-foundations/raw/master/sessions/data/tabernas_meteo_data.txt in pandas using proper parameters in `read_csv`

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(
    "https://github.com/Juanlu001/bts-mbds-data-science-foundations/raw/master/sessions/data/model.txt",
    delim_whitespace=True,
    header=2,
    parse_dates={'date': ['YYYYMMDD', 'HHMM']},
)
df.head()

,date,M(m/s),D(deg),T(C),De(k/m3),PRE(hPa),RiNumber,RH(%)
0,1984-01-01 00:00:00,20.8,243,7.3,1.25,1002.8,0.04,86.3
1,1984-01-01 01:00:00,20.8,243,7.3,1.25,1002.2,0.04,86.9
2,1984-01-01 02:00:00,20.6,243,7.4,1.24,1001.8,0.04,87.0
3,1984-01-01 03:00:00,20.4,244,7.5,1.24,1001.5,0.05,86.2
4,1984-01-01 04:00:00,20.3,245,7.5,1.24,1001.2,0.05,85.6

In [3]:
df.dtypes

date        datetime64[ns]
M(m/s)             float64
D(deg)               int64
T(C)               float64
De(k/m3)           float64
PRE(hPa)           float64
RiNumber           float64
RH(%)              float64
dtype: object

In [4]:
pd.read_csv?

In [5]:
pd.read_csv(
    "https://github.com/Juanlu001/bts-mbds-data-science-foundations/raw/master/sessions/data/tabernas_meteo_data.txt",
    delim_whitespace=True,
    skiprows=[1],
    parse_dates={'date': ['FECHA']},
).drop('DIA', axis=1).head()

        date  Al04TMax  Al04TMin  Al04TMed  Al04Precip
0 2016-12-13      14.6       4.0       8.9         0.2
1 2016-12-12      15.9       3.0       8.7         0.2
2 2016-11-12      16.9       5.0      10.2         0.2
3 2016-10-12      16.4       6.3      10.9         0.2
4 2016-09-12      13.6       9.5      11.2         1.8

## Exercise 2: Titanic dataset

Analyze the dataset of the Titanic passengers https://www.kaggle.com/c/titanic/data

1. Load https://github.com/Juanlu001/bts-mbds-data-science-foundations/raw/master/sessions/data/titanic.csv in pandas
2. What's the percentage of survivors? Men and women?
3. What's the percentage of survival _by sex_?
4. What's _the sex of the survivors_?
5. What is the probability of being male/female, and surviving/not surviving?
6. What is the probability of survival by sex and class?
7. Divide the age in meaningful groups ("bins") and represent the distribution
8. What's the probability of survival by sex and age group?
9. Extract the title ("Mr.", "Mrs.") to a separate column
10. What's the _median_ age of each title?
11. Impute the missing age values using the median for the title

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(
    "https://github.com/Juanlu001/bts-mbds-data-science-foundations/raw/master/sessions/data/titanic.csv",
    index_col="PassengerId"
)
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
df['Age'].mean()

29.69911764705882

In [5]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [3]:
df['Survived'].value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [20]:
df.groupby(['Sex', 'Pclass'])['Survived'].mean()

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

In [27]:
df['Sex'].value_counts(normalize=True)

male      0.647587
female    0.352413
Name: Sex, dtype: float64

In [28]:
0.74 * 0.35

0.259

In [25]:
df.groupby(['Sex'])['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [26]:
_.sum()

0.9309463621410987

In [29]:
df.groupby(['Sex', 'Survived']).size() / len(df)

Sex     Survived
female  0           0.090909
        1           0.261504
male    0           0.525253
        1           0.122334
dtype: float64

In [31]:
_29.unstack()

Survived         0         1
Sex
female    0.090909  0.261504
male      0.525253  0.122334

In [24]:
_22.sum()

1.0

In [6]:
df.loc[df['Sex'] == 'male', 'Survived'].value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [7]:
df.loc[df['Sex'] == 'male', 'Survived'].value_counts(normalize=True)

0    0.811092
1    0.188908
Name: Survived, dtype: float64